src/Reports/ОтчётПоННС/ОтчётПоННС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчётПоННС</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/СтатусыНакладныхНаСборку/СтатусыНакладныхНаСборку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыНакладныхНаСборку</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыНакладнойНаСборку</types>
    </type>
  </resources>
  <dimensions>
    <name>НакладнаяНаСборку</name>
    <type>
      <types>DocumentRef.НакладнаяНаСборку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ЗоныКомплектации/ЗоныКомплектации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЗоныКомплектации</name>
  <enumValues>
    <name>УПЭА</name>
  </enumValues>
  <enumValues>
    <name>УД</name>
  </enumValues>
  <enumValues>
    <name>ДД</name>
  </enumValues>
  <enumValues>
    <name>ТНП</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СтатусыНакладнойНаСборку/СтатусыНакладнойНаСборку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыНакладнойНаСборку</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>НаСборке</name>
  </enumValues>
  <enumValues>
    <name>Собран</name>
  </enumValues>
  <enumValues>
    <name>НаУпаковке</name>
  </enumValues>
  <enumValues>
    <name>Упакован</name>
  </enumValues>
</mdclass:Enum>

src/Documents/НакладнаяНаСборку/НакладнаяНаСборку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НакладнаяНаСборку</name>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КартаДоставки</name>
    <type>
      <types>CatalogRef.КартыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомераТары</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейкаУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КрупныйЗаказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерТары</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаПроизводство</name>
      <type>
        <types>DocumentRef.ЗаказНаПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БарКоды</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>БарКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>18</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗоныКомплектации</name>
    <attributes>
      <name>ЗонаКомплектации</name>
      <type>
        <types>EnumRef.ЗоныКомплектации</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Тары</name>
    <attributes>
      <name>ЗонаКомплектации</name>
      <type>
        <types>EnumRef.ЗоныКомплектации</types>
      </type>
    </attributes>
    <attributes>
      <name>Тара</name>
      <type>
        <types>CatalogRef.ТранспортировочныеТары</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Reports/ОтчётПоННС/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПолучитьКоличествоЗоны(ТЧ,ННС,ЗонаКомплектации)
Запрос = Новый Запрос;
	Если ЗонаКомплектации = Перечисления.ЗоныКомплектации.ТНП Тогда
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НакладнаяНаСборкуТабличнаяЧасть.Продукция КАК Продукция,
		|	НакладнаяНаСборкуТабличнаяЧасть.Количество КАК Количество
		|ИЗ
		|	Документ.НакладнаяНаСборку.ТабличнаяЧасть КАК НакладнаяНаСборкуТабличнаяЧасть
		|ГДЕ
		|	НакладнаяНаСборкуТабличнаяЧасть.Ссылка = &Ссылка
		|	И (ТИПЗНАЧЕНИЯ(НакладнаяНаСборкуТабличнаяЧасть.Продукция) = ТИП(Справочник.Материалы)
		|			ИЛИ НакладнаяНаСборкуТабличнаяЧасть.Продукция.Линейка.ЗонаКомплектации = &ЗонаКомплектации)
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Продукция";	
	Иначе	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НакладнаяНаСборкуТабличнаяЧасть.Продукция КАК Продукция,
		|	НакладнаяНаСборкуТабличнаяЧасть.Количество КАК Количество
		|ИЗ
		|	Документ.НакладнаяНаСборку.ТабличнаяЧасть КАК НакладнаяНаСборкуТабличнаяЧасть
		|ГДЕ
		|	НакладнаяНаСборкуТабличнаяЧасть.Ссылка = &Ссылка
		|	И НакладнаяНаСборкуТабличнаяЧасть.Продукция.Линейка.ЗонаКомплектации = &ЗонаКомплектации
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Продукция";	
	КонецЕсли; 
Запрос.УстановитьПараметр("Ссылка", ННС);
Запрос.УстановитьПараметр("ЗонаКомплектации", ЗонаКомплектации);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаПродукция = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
Количество = 0;
	Пока ВыборкаПродукция.Следующий() Цикл	
	ТЧ.Количество = ТЧ.Количество + ВыборкаПродукция.Количество;
	ТЧ_П = ТЧ.ТаблицаПродукции.Добавить();
	ТЧ_П.Продукция = ВыборкаПродукция.Продукция;
	ТЧ_П.Количество = ВыборкаПродукция.Количество;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
ТаблицаЗоны.Очистить();
ТаблицаТары = Новый ТаблицаЗначений;

ТаблицаТары.Колонки.Добавить("Зона");
ТаблицаТары.Колонки.Добавить("Тара");
ТаблицаТары.Колонки.Добавить("ИсполнительДоставщик");
ТаблицаТары.Колонки.Добавить("ДатаДоставлено");

ТабДок.Очистить();
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");
ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблННС = Макет.ПолучитьОбласть("ННС");
ОблЗона = Макет.ПолучитьОбласть("Зона");
ОблПродукция = Макет.ПолучитьОбласть("Продукция");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	НакладнаяНаСборку.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.НакладнаяНаСборку КАК НакладнаяНаСборку
	|ГДЕ
	|	НакладнаяНаСборку.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И НакладнаяНаСборку.Проведен = ИСТИНА";
	Если Не Автор.Пустая() Тогда
	Запрос.Текст = Запрос.Текст + " И НакладнаяНаСборку.Автор = &Автор";
	Запрос.УстановитьПараметр("Автор", Автор);
	КонецЕсли;
		Если Не Контрагент.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + " И НакладнаяНаСборку.Контрагент = &Контрагент";
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		КонецЕсли;
			Если ЛинейкаУпаковки > 0 Тогда
			Запрос.Текст = Запрос.Текст + " И НакладнаяНаСборку.ЛинейкаУпаковки = &ЛинейкаУпаковки";
			Запрос.УстановитьПараметр("ЛинейкаУпаковки", ЛинейкаУпаковки);
			КонецЕсли;
				Если ЗначениеЗаполнено(ДатаОтгрузки) Тогда
				Запрос.Текст = Запрос.Текст + " И НакладнаяНаСборку.ДатаОтгрузки = &ДатаОтгрузки";
				Запрос.УстановитьПараметр("ДатаОтгрузки", ДатаОтгрузки);
				КонецЕсли; 
Запрос.УстановитьПараметр("ДатаНач", Отчет.Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Отчет.Период.ДатаОкончания);
Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО НакладнаяНаСборку.Дата";
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
КоличествоСоздано = 0;
КоличествоСобрано = 0;
КоличествоДоставлено = 0;
КоличествоНаУпаковке = 0;
КоличествоУпаковано = 0;
КоличествоСозданоВсего = 0;
КоличествоСобраноВсего = 0;
КоличествоДоставленоВсего = 0;
КоличествоНаУпаковкеВсего = 0;
КоличествоУпакованоВсего = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТаблицаЗоны.Очистить();
	ТаблицаТары.Очистить();
	ННС = ВыборкаДетальныеЗаписи.Ссылка;
		Для каждого ТЧ_З Из ННС.ЗоныКомплектации Цикл
			Если Не ЗонаКомплектации.Пустая() Тогда
				Если ТЧ_З.ЗонаКомплектации <> ЗонаКомплектации Тогда
				Продолжить;
				КонецЕсли;
			КонецЕсли;  
				Если Не ИсполнительСборщик.Пустая() Тогда
					Если ТЧ_З.Исполнитель <> ИсполнительСборщик Тогда
					Продолжить;
					КонецЕсли;
				КонецЕсли;
		ТЧ = ТаблицаЗоны.Добавить();  
		ТЧ.Зона = ТЧ_З.ЗонаКомплектации;
		ТЧ.ИсполнительСборщик = ТЧ_З.Исполнитель;
		ТЧ.ДатаРаспечатано = ТЧ_З.ДатаНачала;
		ТЧ.ДатаСобрано = ТЧ_З.ДатаОкончания;
		ПолучитьКоличествоЗоны(ТЧ,ННС,ТЧ_З.ЗонаКомплектации);
			Для каждого ТЧ_Т Из ННС.Тары Цикл
				Если Не ЗонаКомплектации.Пустая() Тогда
					Если ТЧ_З.ЗонаКомплектации <> ЗонаКомплектации Тогда
					Продолжить;
					КонецЕсли;
				КонецЕсли;
					Если Не ИсполнительДоставщик.Пустая() Тогда
						Если ТЧ_Т.Исполнитель <> ИсполнительДоставщик Тогда
						Продолжить;
						КонецЕсли;
					КонецЕсли;
			ТЧ = ТаблицаТары.Добавить();  
			ТЧ.Зона = ТЧ_Т.ЗонаКомплектации;
			ТЧ.Тара = ТЧ_Т.Тара;
			ТЧ.ИсполнительДоставщик = ТЧ_Т.Исполнитель;
			ТЧ.ДатаДоставлено = ТЧ_Т.ДатаОкончания;				
			КонецЦикла; 		
		КонецЦикла;
			//Если (ТаблицаЗоны.Количество() > 0)и(ТаблицаТары.Количество() > 0) Тогда
			Если ТаблицаЗоны.Количество() > 0 Тогда
			ОблННС.Параметры.Номер = ННС.Номер;
			ОблННС.Параметры.ДатаСоздано = ННС.Дата;
			ОблННС.Параметры.ННС = ННС;
			ОблННС.Параметры.ЛинейкаУпаковки = ННС.ЛинейкаУпаковки;
			ОблННС.Параметры.НомераТары = ННС.НомераТары;
			ОблННС.Параметры.Клиент = ННС.Контрагент;
			ОблННС.Параметры.КартаДоставки = ННС.КартаДоставки;
			ОблННС.Параметры.Автор = ННС.Автор;
			КоличествоСоздано = 0;
			КоличествоСобрано = 0;
			КоличествоДоставлено = 0;
			КоличествоНаУпаковке = 0;
			КоличествоУпаковано = 0;
			ДатаРаспечатано = КонецДня(ТекущаяДата()); 
			ДатаСобрано = Дата(1,1,1); 
			ДатаДоставлено = Дата(1,1,1);
		    ДатаНаУпаковке = "";
		    ДатаУпаковано = ""; 
				Для каждого ТЧ Из ТаблицаЗоны Цикл
				КоличествоСоздано = КоличествоСоздано + ТЧ.Количество;
				ДатаРаспечатано = Мин(ДатаРаспечатано,ТЧ.ДатаРаспечатано);
					Если ЗначениеЗаполнено(ТЧ.ДатаСобрано) Тогда
					КоличествоСобрано = КоличествоСобрано + ТЧ.Количество;
					КонецЕсли; 
				КонецЦикла;
					Для каждого ТЧ Из ТаблицаЗоны Цикл
						Если ЗначениеЗаполнено(ТЧ.ДатаСобрано) Тогда
						ДатаСобрано = Макс(ДатаСобрано,ТЧ.ДатаСобрано);
						Иначе
						ДатаСобрано = Дата(1,1,1);
						Прервать;
						КонецЕсли;
					КонецЦикла;
						Если ЗначениеЗаполнено(ДатаСобрано) Тогда
							Для каждого ТЧ Из ТаблицаТары Цикл
								Если ЗначениеЗаполнено(ТЧ.ДатаДоставлено) Тогда
								ДатаДоставлено = Макс(ДатаДоставлено,ТЧ.ДатаДоставлено);
								Иначе
								ДатаДоставлено = Дата(1,1,1);
								Прервать;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
			ОблННС.Параметры.КоличествоСоздано = КоличествоСоздано;
			ОблННС.Параметры.ДатаРаспечатано = ДатаРаспечатано;
			ОблННС.Параметры.ДатаСобрано = ДатаСобрано; 					
			ОблННС.Параметры.ДатаДоставлено = ДатаДоставлено;
			НаборЗаписей = РегистрыСведений.СтатусыНакладныхНаСборку.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.НакладнаяНаСборку.Установить(ННС);
			НаборЗаписей.Прочитать();
			    Для Каждого Запись Из НаборЗаписей Цикл
		        	Если Запись.Статус = Перечисления.СтатусыНакладнойНаСборку.Собран Тогда
					КоличествоДоставлено = КоличествоСоздано;
		        	ИначеЕсли Запись.Статус = Перечисления.СтатусыНакладнойНаСборку.НаУпаковке Тогда
					ДатаНаУпаковке = Запись.Период;
					КоличествоНаУпаковке = КоличествоСоздано;
		        	ИначеЕсли Запись.Статус = Перечисления.СтатусыНакладнойНаСборку.Упакован Тогда
					ДатаУпаковано = Запись.Период;					
					КоличествоУпаковано = КоличествоСоздано;
					КонецЕсли; 
				КонецЦикла;
			ОблННС.Параметры.ДатаНаУпаковке = ДатаНаУпаковке; 					
			ОблННС.Параметры.ДатаУпаковано = ДатаУпаковано;
			ТабДок.Вывести(ОблННС);
			ТабДок.НачатьГруппуСтрок("Зоны",Истина);
				Для каждого ТЧ Из ТаблицаЗоны Цикл
				СписокНомеровТары = Новый СписокЗначений;
				СписокИсполнителейДоставщиков = Новый СписокЗначений;

				ДатаДоставлено = Дата(1,1,1);
				ВыборкаТары = ТаблицаТары.НайтиСтроки(Новый Структура("Зона",ТЧ.Зона));
					Для к = 0 По ВыборкаТары.ВГраница() Цикл	
						Если СписокНомеровТары.НайтиПоЗначению(ВыборкаТары[к].Тара) = Неопределено Тогда
						СписокНомеровТары.Добавить(ВыборкаТары[к].Тара);
						КонецЕсли;
					ДатаДоставлено = Макс(ДатаДоставлено,ВыборкаТары[к].ДатаДоставлено);
						Если СписокИсполнителейДоставщиков.НайтиПоЗначению(ВыборкаТары[к].ИсполнительДоставщик) = Неопределено Тогда
						СписокИсполнителейДоставщиков.Добавить(ВыборкаТары[к].ИсполнительДоставщик);
						КонецЕсли;  
					КонецЦикла;	
				ОблЗона.Параметры.Зона = ТЧ.Зона;
				ОблЗона.Параметры.НомераТары = СписокНомеровТары;
				ОблЗона.Параметры.КоличествоСоздано = ТЧ.Количество;
				ОблЗона.Параметры.ДатаРаспечатано = ТЧ.ДатаРаспечатано;
				ОблЗона.Параметры.ДатаСобрано = ТЧ.ДатаСобрано;
				ОблЗона.Параметры.ИсполнительСборщик = ТЧ.ИсполнительСборщик; 					
				ОблЗона.Параметры.ДатаДоставлено = ДатаДоставлено;
				ОблЗона.Параметры.ИсполнительДоставщик = СписокИсполнителейДоставщиков;					
				ТабДок.Вывести(ОблЗона);
				ТабДок.НачатьГруппуСтрок("Продукция",Истина);
					Для каждого ТЧ_П Из ТЧ.ТаблицаПродукции Цикл
					ОблПродукция.Параметры.Продукция = ТЧ_П.Продукция;
					ОблПродукция.Параметры.КоличествоСоздано = ТЧ_П.Количество;
					ТабДок.Вывести(ОблПродукция);
					КонецЦикла;
				ТабДок.ЗакончитьГруппуСтрок();
				КонецЦикла; 
			ТабДок.ЗакончитьГруппуСтрок();
			КоличествоСозданоВсего = КоличествоСозданоВсего + КоличествоСоздано;
			КоличествоСобраноВсего = КоличествоСобраноВсего + КоличествоСобрано;
			КоличествоДоставленоВсего = КоличествоДоставленоВсего + КоличествоДоставлено;
			КоличествоНаУпаковкеВсего = КоличествоНаУпаковкеВсего + КоличествоНаУпаковке;
			КоличествоУпакованоВсего = КоличествоУпакованоВсего + КоличествоУпаковано;			
			КонецЕсли;  
	КонецЦикла;
ОблКонец.Параметры.КоличествоСоздано = КоличествоСозданоВсего;
ОблКонец.Параметры.КоличествоСобрано = КоличествоСобраноВсего;
ОблКонец.Параметры.КоличествоДоставлено = КоличествоДоставленоВсего;
ОблКонец.Параметры.КоличествоНаУпаковке = КоличествоНаУпаковкеВсего;
ОблКонец.Параметры.КоличествоУпаковано = КоличествоУпакованоВсего;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 2;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры
